#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/gamersnote/gamersnote/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/gamersnote/gamersnote

To view this run in a browser, visit:
https://app.terraform.io/app/happyfukumoto/gamersnote/runs/run-RsqcdxJt6xdE3evu

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.module.aws_vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0e81ff7ec6af5af90]
module.ecr.aws_ecr_repository.api: Refreshing state... [id=gamersnote-api]
module.vpc.module.aws_vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b912a34575a4253a]
module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ap-northeast-1:455000526485:certificate/00a8ad21-ff76-4da4-845e-df28678f7b2b]
module.ecr.aws_ecr_repository.app: Refreshing state... [id=gamersnote-app]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:455000526485:cluster/gamersnote]
module.acm.aws_route53_record.this["gamersnote.com"]: Refreshing state... [id=Z05181772U0208ZLB3AL8__8206226daa44e7e47b445ae8273d8106.gamersnote.com._CNAME]
module.acm.aws_acm_certificate_validation.this: Refreshing state... [id=2020-12-18 12:55:48 +0000 UTC]
module.vpc.module.aws_vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-07153c3f6cb0fcc1f]
module.alb.aws_security_group.alb: Refreshing state... [id=sg-00a0a573a96120ec3]
module.vpc.module.aws_vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0999cbab79b0169de]
module.vpc.module.aws_vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0038bf597d7fa3342]
module.vpc.module.aws_vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01901d747fa38dd39]
module.vpc.module.aws_vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-086a526a8e2940105]
module.ecs.aws_security_group.this: Refreshing state... [id=sg-05f0ddf40cf30e7c3]
module.vpc.module.aws_vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-03d35f9d7f8e1d1b1]
module.vpc.module.aws_vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-007848b304bba0120]
module.alb.module.aws_alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:loadbalancer/app/gamersnote-alb/d9ddc26d4c0823a6]
module.vpc.module.aws_vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0eb1a678d2b5eae2d]
module.vpc.module.aws_vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01901d747fa38dd391080289494]
module.vpc.module.aws_vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cd0e858ac8458eb4]
module.vpc.module.aws_vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06d189796c3405612]
module.vpc.module.aws_vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-037f7097ace0bc71b]
module.vpc.module.aws_vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0455706d64301bbcf]
module.vpc.module.aws_vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-07153c3f6cb0fcc1f1080289494]
module.alb.module.aws_alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:targetgroup/gn-20201218125837691800000002/94da241c0ea57274]
module.alb.aws_route53_record.this: Refreshing state... [id=Z05181772U0208ZLB3AL8_gamersnote.com_A]
module.alb.module.aws_alb.aws_lb_listener.frontend_https[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:listener/app/gamersnote-alb/d9ddc26d4c0823a6/b8a513befb65e349]
module.alb.module.aws_alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:listener/app/gamersnote-alb/d9ddc26d4c0823a6/3e2ab12ba64b7f72]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.api will be created
  + resource "aws_ecs_service" "api" {
      + cluster                            = "gamersnote"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "gamersnote-api"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "api"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:targetgroup/gn-20201218125837691800000002/94da241c0ea57274"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-05f0ddf40cf30e7c3",
            ]
          + subnets          = [
              + "subnet-007848b304bba0120",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.api will be created
  + resource "aws_ecs_task_definition" "api" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + image        = "nginx:1.14"
                  + name         = "api"
                  + portMappings = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                        },
                    ]
                  + secrets      = [
                      + {
                          + name      = "POSTGRES_HOST"
                          + valueFrom = "gamersnote-postgres-host"
                        },
                      + {
                          + name      = "POSTGRES_USER"
                          + valueFrom = "gamersnote-postgres-user"
                        },
                      + {
                          + name      = "POSTGRES_PASSWORD"
                          + valueFrom = "gamersnote-postgres-password"
                        },
                      + {
                          + name      = "POSTGRES_DBNAME"
                          + valueFrom = "gamersnote-postgres-dbname"
                        },
                      + {
                          + name      = "POSTGRES_PORT"
                          + valueFrom = "gamersnote-postgres-port"
                        },
                      + {
                          + name      = "EMAIL_FROM_ADDRESS"
                          + valueFrom = "gamersnote-email-from-address"
                        },
                      + {
                          + name      = "AWS_ACCESS_KEY_ID"
                          + valueFrom = "gamersnote-aws-access-key-id"
                        },
                      + {
                          + name      = "AWS_SECRET_KEY"
                          + valueFrom = "gamersnote-aws-secret-key"
                        },
                      + {
                          + name      = "AWS_REGION"
                          + valueFrom = "gamersnote-aws-region"
                        },
                      + {
                          + name      = "BASE_URL"
                          + valueFrom = "gamersnote-base-url"
                        },
                      + {
                          + name      = "S3_BUCKET"
                          + valueFrom = "gamersnote-s3-bucket"
                        },
                      + {
                          + name      = "S3_BASEURL"
                          + valueFrom = "gamersnote-s3-base-url"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + family                   = "gamersnote-api"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # module.ecs.aws_iam_policy.ecs_task_policy will be created
  + resource "aws_iam_policy" "ecs_task_policy" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "ecs_task_policy"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.ecs.aws_iam_policy_attachment.attach will be created
  + resource "aws_iam_policy_attachment" "attach" {
      + id         = (known after apply)
      + name       = "attach"
      + policy_arn = (known after apply)
      + roles      = [
          + "ecs_task_role",
        ]
    }

  # module.ecs.aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs_task_role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>
*Pusher: @happyfukumoto, Action: `pull_request`*